{
	"name": "Oleksandr Narykov",
	"school": "Worcester Polytechnic Institute",
	"copyrightStartYear": "2015",
	"repo": "onarykov/research-website",
	"social": {
		"googleScholar": "3pMgtQgAAAAJ",
		"github": "AlexandrNP",
		"linkedin": "oleksandr-narykov",
		"facebook": "alexander.narykov.7",
		"twitter": "onarykov",
		"email": "onarykov@wpi.edu",
		"phone": "857-999-5317"
	},
	"texts": {
		"index": "The mind is not a vessel to be filled but a torch to be set ablaze",
		"research": "I am a Computer Science PhD candidate at WPI KorkinLab (<a href=\"http://korkinlab.org/\" target=\"_blank\">Korkin lab</a>) under supervision of <a href=\"https://www.wpi.edu/people/faculty/dkorkin\" target=\"_blank\">Dmitry Korkin</a>. My research is centered around proteomics with an emphasis on network analysis and machine learning. In particular, I am working on application of machine learning models to answer the question how alternative splicing reshapes human interactome. I am looking for postdoc positions in my field and I am open to collaboration. <p>Currently I work on the following projects: <ul class=\"ul-withdetails\"> <li> <b>ALT-IN Tool</b> - project to build machine learning model for prediction of gene isoforms interactions. It leverages existing interactome data and includes <b>alternative splicing</b>-specific information. I analyzed several machine learning approaches, including utilization of <b>L</b>earning <b>U</b>nder <b>P</b>rivileged <b>I</b>nformation (<b>LUPI</b>) paradigm. I handled machine learning-related tasks, a part of data extraction and case study analysis and produces deliverables publicly available on <a href=\"https://github.com/korkinlab/altintool\" target=\"_blank\"> GitHub </a>  and <a href=\"https://hub.docker.com/r/narykov/alt-in\" target=\"_blank\"> DockerHub </a>. </li> <li> <b>Clinical trials of Gulf War Illness treatment</b> - I was responsible for identifying gene set that exhibit response to acupuncture treatment based on <b>SomaScan</b> proteomics data. First, I evaluated different strategies for intra- and interplate normalization. Then I employed a range of statistical methods and successfully identified relevant genes. This discovery was further supported by literature search. I also conducted a preliminary work on <b>biomarkers identification</b> of the successful treatment. This work was done as a part of a joint grant application. </li> <li> <b>Molecular dynamics of SARS-CoV-2 envelope</b> - Ongoing project close to the completion. Collaborative effort on bringing together accuate stoichiometry, geometry, and structural information on SARS-CoV-2 envelope. My responsibilities include part of the <b>structural modeling</b> of membrane (M) protein and system integration, as well as performing molecular dynamics simulations on <a href=\"https://frontera-portal.tacc.utexas.edu/\" target=\"_blank\"> <b>Frontera supercomputer</b> </a> and network analysis on protein connectivity. </li> </ul>",
		"contact": "I welcome collaboration opportunities and I gladly communicate with people. If I may be of assistance feel free to shoot me an email. I am open to any means of communication, from person-to-person meetings, to chats, to video calls.",
		"lab": "<p>I am currently commuting spending about 50%/50% time between Boston and Worcester </p>"
	},
	"keywords": [
		"oleksandr",
		"narykov",
		"research",
		"PhD",
		"computational biology",
		"computer science",
		"worcester polytechnic institute"
	],
	"googleAnalyticsId": "UA-201154048-1"
}